14-symbol-table-and-recursion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 14: Symbol Table and Recursion</title>
<!-- 2013-05-31 Fri 19:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="michal"/>
<link rel="stylesheet" type="text/css" href="/etc/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Chapter 14: Symbol Table and Recursion</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. </a></li>
<li><a href="#sec-2">2. THE MACHINE</a>
<ul>
<li><a href="#sec-2-1">2.1. A Brief Description</a></li>
<li><a href="#sec-2-2">2.2. The Simulating Program</a></li>
</ul>
</li>
<li><a href="#sec-3">3. DESIGNING THE HIGH LEVEL LANGUAGE</a>
<ul>
<li><a href="#sec-3-1">3.1. Language Level</a></li>
<li><a href="#sec-3-2">3.2. Syntax</a></li>
</ul>
</li>
<li><a href="#sec-4">4. DESIGNING THE COMPILER</a>
<ul>
<li><a href="#sec-4-1">4.1. Syntax</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. Step 1: <i>Visibility requirements</i>.</a></li>
<li><a href="#sec-4-1-2">4.1.2. Step 2: <i>Context free parsing</i>:</a></li>
<li><a href="#sec-4-1-3">4.1.3. Step 3: <i>Declarations</i>:</a></li>
<li><a href="#sec-4-1-4">4.1.4. Step 4: <i>Types</i>.</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Semantics</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Step 5: <i>Memory management</i>.</a></li>
<li><a href="#sec-4-2-2">4.2.2. Step 6: <i>Generating opcodes</i>:</a></li>
<li><a href="#sec-4-2-3">4.2.3. Step 7: <i>Memory references</i>.</a></li>
<li><a href="#sec-4-2-4">4.2.4. Step 8: <i>Code references</i>.</a></li>
<li><a href="#sec-4-2-5">4.2.5. Step 9: <i>Register references</i>.</a></li>
<li><a href="#sec-4-2-6">4.2.6. Step 10: <i>Constant folding</i>.</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. A Look Inside</a></li>
</ul>
</li>
<li><a href="#sec-5">5. The Compiler</a></li>
<li><a href="#sec-6">6. Exercises and Reading</a>
<ul>
<li><a href="#sec-6-1">6.1. <i>Manual</i>:</a></li>
<li><a href="#sec-6-2">6.2. <i>Use of identifiers</i>:</a></li>
<li><a href="#sec-6-3">6.3. <i>Records and arrays</i>:</a></li>
<li><a href="#sec-6-4">6.4. <i>Constant folding</i>:</a></li>
<li><a href="#sec-6-5">6.5. <i>A different machine</i>:</a></li>
<li><a href="#sec-6-6">6.6. <i>Instruction folding</i>:</a></li>
<li><a href="#sec-6-7">6.7. <i>Parameters</i>:</a></li>
<li><a href="#sec-6-8">6.8. <i>Functions</i>:</a></li>
<li><a href="#sec-6-9">6.9. <i>Input and output</i>:</a></li>
<li><a href="#sec-6-10">6.10. <i>An assembler</i>:</a></li>
<li><a href="#sec-6-11">6.11. <i>Reading</i>:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a id="intro" name="intro"></a></h2>
<div class="outline-text-2" id="text-1">
<p>
As in the previous chapter, we shall again take an approach that is different from the one taken in other chapters.  Instead of designing a program which only has to meet user specification, we shall design one that has to meet two specifications: - a low level specification of the hardware on which the compiled program is to run, and a high level specification of the language that is used for communicating with the hardware.  Actually, we shall not be dealing with "real" hardware, but only with "virtual" hardware; although it would be possible for someone to build the hardware out of real transistors, we shall use the specification of the hardware as a software interpreter.
</p>

<p>
The compiler and interpreter in this chapter should be studied as alternatives to Wirth's (1976, pp 307 - 349) PLZERO compiler and interpreter.  While they have a fair amount in common, there are sufficient differences to make it profitable to study both - probably in any order.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> THE MACHINE</h2>
<div class="outline-text-2" id="text-2">
<p>
This section gives a brief description of the machine together with a PASCAL program for simulating the machine.  The machine is a typical von Neumann machine, although it is much smaller than most actual ones are.  Before running, the machine has to load its program from an external file into its internal memory.  It then starts by executing the first instruction, always continuing with the next instruction unless explicitly told to do otherwise.  Even at this very gross level, the machine is different from the recursive machine we designed in Chapter#7.  The machine is similar to the parsing machine of the previous Chapter, although there are many more instructions.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> A Brief Description</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The machine has 8 registers used for arithmetic and logical operations, and a memory that can be accessed randomly, either directly or modified by a base register.  Instructions consist of an operator together with two addresses or values.  There are the usual arithmetic and logical operations which operate on the contents of registers, instructions for loading from memory into registers or for storing from registers into memory, unconditional and conditional jump instructions and procedure call and return.
</p>

<p>
For the first 12 instructions the two addresses are names of registers, and the effect of such an instruction is to compute a value from the two values in the two registers given by the two addresses, and to store it in the value given by the first address.  There is a further 13-th instruction which does not use a second register.
</p>

<p>
The first five instructions perform arithmetic operations: addition, subtraction, multiplication, division and the modulus operation.  The next six instructions perform comparisons on the contents of two registers, and return 1 if the comparison is true, and 0 if not.
</p>

<p>
There is also a disjunction operation which returns 1 if at least one register contain 1, and 0 otherwise.  There is no conjunction instruction, but the last instruction in this group performs complementation with respect to 1.
</p>

<p>
The next three instructions transfer data into registers, the next four transfer data from registers.  Of these seven, the first instruction transfers from a memory location given by the second address to the register given by the first address; the second instruction is similar, except that is does not use the second address directly but as an offset from a base register - this is useful for local variables of (potentially) recursive procedures for which multiple instances may exist at run time.  In the third instruction the second address field is not used as an address at all but as the literal value to be put into the register given by the first address.  The next two instructions transfer data from registers into memory, either directly or relative to the base register.  The last two instructions are for output, they can be used to write the contents of a register in Boolean or integer form.
</p>

<p>
The next three instructions control the program counter, and the last two also set the base register as needed for local variables and a further register for the top of the stack.  Of these five, the first is an unconditional jump instruction to a code address given by the first address, the second is similar except that the jump is conditional upon the register given by the second address containing the value 0, the third sets the program counter to 0 causing the machine to stop execution.  Much more difficult to understand are the last two instructions which are for (potentially recursive) procedure call and return.  When a procedure is being called, then it has to be known (before execution begins)
</p>

<ol class="org-ol">
<li>what its start address in the code is, and
</li>
<li>how many local variables it has.
</li>
</ol>

<p>
The compiler or assembler has to put these two items of information into the two address fields of the call instruction.  What is not known at compile time is how deep in the recursion the current call will be at run time.  It is for this purpose that a special register is needed for the top of the stack containing local variables of still active procedures.  For each procedure call the following information is needed for correct returns: the value of the base register, and the program counter for the instruction that is to be executed after the return of the procedure.  These two items have to be recorded on the stack by the call instruction, and they are restored by the return instruction.  When the call instruction has saved these two items, it can safely change them: set the base register to the stack top, set the program counter to the address given by the first address field of the instruction.  And finally the call instruction can increment the top of stack register by the value of the second address field; this is in preparation for a potential call from the procedure to ensure that the two items saved and any locals do not get clobbered.
</p>
</div>
</div>
