text/14-symbol-table-and-recursion.org
** The Simulating Program

The details of the machine may be seen from the following PASCAL program.  Note that input is not declared in the program header.  This is because the program does not take its input from a standard text file, but from a user declared file type which resembles machine code.  When the content of this file has been loaded, interpretation begins.

#+begin_src pascal
PROGRAM syreci(output);
(* SYmboltable, RECursion, INTerpreter only,
   interprets a file of instruction produced by syrecc *)

LABEL 99;

CONST
    inputfile = '32syreci.tmp';
    showcode = false;
    tracing = false;
    maxcode = 200;
    maxstack = 1000;
    topregister = 7;

TYPE
    operator = (
	add, sub, mul, dvd, mdl, eql, neq, gtr, geq, lss, leq, orr,
	neg, loadglobl, loadlocal, loadimmed, storglobl, storlocal,
	writebool, writeint, cal, ret, jmp, jiz, hlt);
    instruction = RECORD op : operator; ad1,ad2 : integer END;

VAR
    infile : PACKED FILE OF instruction;
    code : ARRAY [1..maxcode] OF instruction;
    I : integer;

    pc : integer;
    ir : instruction;
    stack : ARRAY [0..maxstack] OF integer;
    stacktop : 0..maxstack;
    reg : ARRAY [0..topregister] OF integer;
    baseregister : integer;

BEGIN (* main *)
writeln('SYRECI ...');

(* load: *)
open(infile,inputfile,OLD); reset(infile);
i := 0;
WHILE NOT eof(infile) DO
    BEGIN
    i := i + 1;
    code[i] := infile^;
    IF showcode THEN WITH code[i] DO writeln(i,op,ad1,ad2);
    get(infile)
    END;

(* interpret: *)
IF tracing THEN writeln('interpreting ...');
stacktop := 0;
pc := 1;
REPEAT
    WITH code[pc] DO
	BEGIN
	IF tracing THEN writeln(pc,op,ad1,ad2);
	pc := pc + 1;
	CASE op OF

	    add : reg[ad1] := reg[ad1] + reg[ad2];
	    sub : reg[ad1] := reg[ad1] - reg[ad2];
	    mul : reg[ad1] := reg[ad1] * reg[ad2];
	    dvd : reg[ad1] := reg[ad1] DIV reg[ad2];
	    mdl : reg[ad1] := reg[ad1] MOD reg[ad2];
	    eql : reg[ad1] := ord(reg[ad1] = reg[ad2]);
	    neq : reg[ad1] := ord(reg[ad1] <> reg[ad2]);
	    gtr : reg[ad1] := ord(reg[ad1] > reg[ad2]);
	    geq : reg[ad1] := ord(reg[ad1] >= reg[ad2]);
	    lss : reg[ad1] := ord(reg[ad1] < reg[ad2]);
	    leq : reg[ad1] := ord(reg[ad1] <= reg[ad2]);
	    orr : reg[ad1] := ord((reg[ad1]=1) OR (reg[ad2]=1));
	    neg : reg[ad1] := 1 - reg[ad1];

	    loadglobl : reg[ad1] := stack[ad2];
	    loadlocal : reg[ad1] := stack[ad2 + baseregister];
	    loadimmed : reg[ad1] := ad2;
	    storglobl : stack[ad1] := reg[ad2];
	    storlocal : stack[ad1 + baseregister] := reg[ad2];
	    writebool : writeln(reg[ad2] = 1);
	    writeint  : writeln(reg[ad2]);

	    jmp : pc := ad1;
	    jiz : IF reg[ad2] = 0 THEN pc := ad1;
	    hlt : pc := 0;
	    cal :
		BEGIN
		IF stacktop + ad2 > maxstack THEN
		    BEGIN
		    writeln('stack overflow,',
			    ' PC =',pc-1:6,' , execution aborted');
		    GOTO 99
		    END;
		stack[stacktop + 1] := baseregister;
		stack[stacktop + 2] := pc;
		baseregister := stacktop;
		pc := ad1;
		stacktop := stacktop + ad2
		END;
	    ret :
		BEGIN
		stacktop := baseregister;
		pc := stack[stacktop + 2];
		baseregister := stack[stacktop + 1]
		END

	    END (* CASE *)
	END (* WITH *)
    UNTIL pc = 0;
99:
END. (* main *)
#+end_src

* DESIGNING THE HIGH LEVEL LANGUAGE

In this section we shall design a high level language to match the low level machine language described by the interpreter program of the previous section.

