14-symbol-table-and-recursion.html
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> The Simulating Program</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The details of the machine may be seen from the following PASCAL program.  Note that input is not declared in the program header.  This is because the program does not take its input from a standard text file, but from a user declared file type which resembles machine code.  When the content of this file has been loaded, interpretation begins.
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">PROGRAM</span> <span style="color: #ffffff; font-weight: bold;">syreci</span>(output);
<span style="color: #66f;">(* </span><span style="color: #66f;">SYmboltable, RECursion, INTerpreter only,</span>
<span style="color: #66f;">   interprets a file of instruction produced by syrecc *)</span>

LABEL 99;

<span style="color: #ff00ff;">CONST</span>
    inputfile = <span style="color: #00ff00;">'32syreci.tmp'</span>;
    showcode = false;
    tracing = false;
    maxcode = 200;
    maxstack = 1000;
    topregister = 7;

<span style="color: #ff00ff;">TYPE</span>
    operator = (
        add, sub, mul, dvd, mdl, eql, neq, gtr, geq, lss, leq, orr,
        neg, loadglobl, loadlocal, loadimmed, storglobl, storlocal,
        writebool, writeint, cal, ret, jmp, jiz, hlt);
    instruction = <span style="color: #ff00ff;">RECORD</span> op : operator; ad1,ad2 : <span style="color: #ff00ff;">integer</span> <span style="color: #00ffff;">END</span>;

<span style="color: #ff00ff;">VAR</span>
    infile : <span style="color: #ff00ff;">PACKED</span> <span style="color: #ff00ff;">FILE</span> <span style="color: #00ffff;">OF</span> instruction;
    code : <span style="color: #ff00ff;">ARRAY</span> [1..maxcode] <span style="color: #00ffff;">OF</span> instruction;
    I : <span style="color: #ff00ff;">integer</span>;

    pc : <span style="color: #ff00ff;">integer</span>;
    ir : instruction;
    stack : <span style="color: #ff00ff;">ARRAY</span> [0..maxstack] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">integer</span>;
    stacktop : 0..maxstack;
    reg : <span style="color: #ff00ff;">ARRAY</span> [0..topregister] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">integer</span>;
    baseregister : <span style="color: #ff00ff;">integer</span>;

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">main *)</span>
writeln(<span style="color: #00ff00;">'SYRECI ...'</span>);

<span style="color: #66f;">(* </span><span style="color: #66f;">load: *)</span>
open(infile,inputfile,OLD); reset(infile);
i := 0;
<span style="color: #00ffff;">WHILE</span> <span style="color: #00ffff;">NOT</span> eof(infile) <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span>
    i := i + 1;
    code[i] := infile^;
    <span style="color: #00ffff;">IF</span> showcode <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">WITH</span> code[i] <span style="color: #00ffff;">DO</span> writeln(i,op,ad1,ad2);
    get(infile)
    <span style="color: #00ffff;">END</span>;

<span style="color: #66f;">(* </span><span style="color: #66f;">interpret: *)</span>
<span style="color: #00ffff;">IF</span> tracing <span style="color: #00ffff;">THEN</span> writeln(<span style="color: #00ff00;">'interpreting ...'</span>);
stacktop := 0;
pc := 1;
<span style="color: #00ffff;">REPEAT</span>
    <span style="color: #00ffff;">WITH</span> code[pc] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">IF</span> tracing <span style="color: #00ffff;">THEN</span> writeln(pc,op,ad1,ad2);
        pc := pc + 1;
        <span style="color: #00ffff;">CASE</span> op <span style="color: #00ffff;">OF</span>

            add : reg[ad1] := reg[ad1] + reg[ad2];
            sub : reg[ad1] := reg[ad1] - reg[ad2];
            mul : reg[ad1] := reg[ad1] * reg[ad2];
            dvd : reg[ad1] := reg[ad1] <span style="color: #00ffff;">DIV</span> reg[ad2];
            mdl : reg[ad1] := reg[ad1] <span style="color: #00ffff;">MOD</span> reg[ad2];
            eql : reg[ad1] := ord(reg[ad1] = reg[ad2]);
            neq : reg[ad1] := ord(reg[ad1] &lt;&gt; reg[ad2]);
            gtr : reg[ad1] := ord(reg[ad1] &gt; reg[ad2]);
            geq : reg[ad1] := ord(reg[ad1] &gt;= reg[ad2]);
            lss : reg[ad1] := ord(reg[ad1] &lt; reg[ad2]);
            leq : reg[ad1] := ord(reg[ad1] &lt;= reg[ad2]);
            orr : reg[ad1] := ord((reg[ad1]=1) <span style="color: #00ffff;">OR</span> (reg[ad2]=1));
            neg : reg[ad1] := 1 - reg[ad1];

            loadglobl : reg[ad1] := stack[ad2];
            loadlocal : reg[ad1] := stack[ad2 + baseregister];
            loadimmed : reg[ad1] := ad2;
            storglobl : stack[ad1] := reg[ad2];
            storlocal : stack[ad1 + baseregister] := reg[ad2];
            writebool : writeln(reg[ad2] = 1);
            writeint  : writeln(reg[ad2]);

            jmp : pc := ad1;
            jiz : <span style="color: #00ffff;">IF</span> reg[ad2] = 0 <span style="color: #00ffff;">THEN</span> pc := ad1;
            hlt : pc := 0;
            cal :
                <span style="color: #00ffff;">BEGIN</span>
                <span style="color: #00ffff;">IF</span> stacktop + ad2 &gt; maxstack <span style="color: #00ffff;">THEN</span>
                    <span style="color: #00ffff;">BEGIN</span>
                    writeln(<span style="color: #00ff00;">'stack overflow,'</span>,
                            <span style="color: #00ff00;">' PC ='</span>,pc-1:6,<span style="color: #00ff00;">' , execution aborted'</span>);
                    <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">99</span>
                    <span style="color: #00ffff;">END</span>;
                stack[stacktop + 1] := baseregister;
                stack[stacktop + 2] := pc;
                baseregister := stacktop;
                pc := ad1;
                stacktop := stacktop + ad2
                <span style="color: #00ffff;">END</span>;
            ret :
                <span style="color: #00ffff;">BEGIN</span>
                stacktop := baseregister;
                pc := stack[stacktop + 2];
                baseregister := stack[stacktop + 1]
                <span style="color: #00ffff;">END</span>

            <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
        <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">WITH *)</span>
    <span style="color: #00ffff;">UNTIL</span> pc = 0;
99:
<span style="color: #00ffff;">END</span>. <span style="color: #66f;">(* </span><span style="color: #66f;">main *)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> DESIGNING THE HIGH LEVEL LANGUAGE</h2>
<div class="outline-text-2" id="text-3">
<p>
In this section we shall design a high level language to match the low level machine language described by the interpreter program of the previous section.
</p>
</div>
