14-symbol-table-and-recursion.html

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Language Level</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We now come to deciding on the level of the language, and there are many possibilities here.  At the one extreme is a language that is not high level at all, but is nothing but an assembler with symbolic instructions.  In such a language a program would be a sequence of instructions like these two:
</p>

<div class="org-src-container">

<pre class="src src-pascal">ADD             1       2
STOREGLOBAL     17      1
</pre>
</div>

<p>
This would mean: take the contents of registers 1 and 2, add these two values and put the result into register 1; then store the contents of register 1 in the memory location whose absolute address is 17.  A major improvement would be the use of symbolic addresses to replace numeric references to memory locations (such as 17 above).  Symbols instead of numbers could also be used to refer to code addresses in unconditional and conditional jumps and in procedure calls.
</p>

<p>
At the other extreme is a ultra high level language with inbuilt artificial intelligence.  This would be a very ambitious project, and it is quite out of the question - and not simply because the machine architecture lacks several facilities that one would need.  Instead we shall design a small language at about the same level as a very simple form of ALGOL, PASCAL or ADA.  Firstly, the registers of the machine will entirely disappear from the view of the programmer.  Secondly, absolute and relative memory locations will be referred to by symbolic global or local variable names.  Local variables will be invisible outside the procedure to which they are local, and all variables will be typed.  Thirdly, procedures are called by a symbolic name rather than by a code address, and jumps to code addresses will be eliminated in favour of structured flow of control.
</p>

<p>
High level languages are nothing but convenience to the user, anything that can be done in the high level language can also be done in the machine language.  But we want to ensure that everything that the machine can do can also be done in the high level language.  So our approach will be to examine the machine instructions in groups.  Since the machine contains the arithmetic operations and arithmetic comparisons, we shall put them into the high level language too.  For the Boolean operations, disjunction and negation are available on the machine.  For conjunction we could use the simulation "p AND q" is equivalent (by De Morgan) to "NOT(NOT p OR NOT q)", but there is a simpler one using multiplication.  So both integers and Booleans can be fully supported.  So we can have a data type of integer and a data type of Boolean, we can have operations on both data types, and we can have integer relations yielding Boolean values.  Since the machine can distinguish between direct access to memory and relative access via a base register, we can have global variables in the main program and local variables in procedures.  This also requires that the base register is set correctly by the call and return instructions.
</p>

<p>
As may be seen, the semantic primitives for the high level language should include at least the two types Boolean and integer, with constants and both global and local variables occurring in expressions built up by familiar operations, and should include assignment statements to variables of these types.  Some flow of control will be needed, too, and we shall aim for structured control statements such as conditionals, loops and procedure calls.  This is only a modest beginning, but for the time being we shall be content with this.  The exercises at the end of the chapter give some suggestions how the language can be extended further.
</p>
</div>
</div>
