text/14-symbol-table-and-recursion.org
** Syntax

We begin with expressions, which will be typed.  For binary operators we have the choice of prefix, infix or postfix notation, and to make the notation as conventional as possible we use infix.  Now a decision has to be made about precedences.  The most conventional precedence ordering for type number is that multiplication takes precedence over addition which takes precedence over comparisons, and for type Boolean it is that negation takes precedence over conjunction which takes precedence over disjunction.  This still leaves open the precedence ordering between the types.  PASCAL programmers sometimes complain that they cannot write

#+begin_src pascal
	IF  a < b  AND  c = d  THEN  ...
#+end_src

but have to put both comparisons into parentheses.  This is easily fixed by treating comparisons like Boolean atoms whose precedence is higher than that of conjunction.  The most natural syntax now is:

#+begin_src pascal
factor		::=  variable | number | "FALSE" | "TRUE" |
		     "NOT" factor | "(" expression2 ")"
term1		::=  factor [ ("*" | "/" | "MOD") factor ]
expression1	::=  term1 [ ("+" | "-") term1 ]
comparison	::=  expression1 [ ("<" | "=" | ">") expression1 ]
term2		::=  comparison [ "AND" comparison ]
s-expression	::=  term2 [ "OR" term2 ]
expression2	::=  s-expression [ "IFF" s-expression ]
#+end_src

This makes all infix operators more or less alike as far as the context free syntax.  There will be some obvious type restrictions: factors which are variables will have the type of the variable, constant factors have type integer or Boolean, negations are Boolean and must have a Boolean operand, parenthesised factors have the type of the expressions2.  All arithmetic and comparison operators require integer operands, the arithmetic operators return integer type and the comparisons return Boolean.  The logical infix operators all return Boolean.  It is important to keep in mind that the strict division into two types is in no way forced upon us by the machine - we could equally well have chosen to have these operators without any type enforcement.

Statements are either assignments, procedure calls, conditionals, loops or write statements.  As an illustration only, we choose not to have a compound statement of the form "BEGIN ... END", so the two kinds of statement which sometimes need an embedded statement sequence will have to have these built in.  This is done by several languages, including MODULA; a disadvantage is that the two sorts of ENDs are now compulsory even when there is only one statement in the statement sequence, and an advantage is that one is more likely to be able to track missing ENDs.

#+begin_src pascal
statement  ::=	variable ":=" expression2 |
		procedure |
		"IF" expression2 "THEN" statementsequence "ENDIF" |
		"WHILE" expression2 "DO" statementsequence "ENDWHILE"
statementsequence  ::=  statement [ ";" statement ]
#+end_src

Since expressions are being typed, we shall insist that the tests in IF and WHILE statements are indeed of type Boolean.  The bodies of procedures and also of the main program will typically be statement sequences, so the following will be more readable:

#+begin_src pascal
body   ::=   "BEGIN" statementsequence "END"
#+end_src

Finally, we can design the structure of a main program.  It is beneficial to program structure if declarations of variables and of procedures can be given in any order.  We have already decided that variables are to be typed, so a type indicator is needed for both types, we can make the indicator also signal that what is being declared is a variable.  Inside a procedure the same indicators serve to declare local variables.

#+begin_src pascal
program   ::=	[ ("BOOLEAN" | "INTEGER") [identifier] |
		  "PROCEDURE" identifier
		    [ ("BOOLEAN" | "INTEGER") [identifier] ]
		    body ]
		body "."
#+end_src

We shall insist that identifiers be declared before use, but that local variables in one procedure are not visible to the outside - so different procedures can use local variables by the same name.  We shall also require that local variables do not have the same name as global ones; this is a controversial paternalistic design decision that you may wish to discuss.

At the end of the next section is a file containing three example programs.  The first illustrates recursion by computing factorials.  The second illustrates the operator precedences.  The third is there to illustrate what can be done by the compiler for generating code for expressions whose value is known at compile time.  

* DESIGNING THE COMPILER

"The bliss of the language designer is matched only by the torment of the language implementor."  (Ancient proverb, late 20-th Century)

This section gives a description of the design of the compiler.  We follow the design steps recommended in Chapter 7, by distinguishing syntax and semantics.

