14-symbol-table-and-recursion.html
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Syntax</h3>
<div class="outline-text-3" id="text-3-2">
<p>
We begin with expressions, which will be typed.  For binary operators we have the choice of prefix, infix or postfix notation, and to make the notation as conventional as possible we use infix.  Now a decision has to be made about precedences.  The most conventional precedence ordering for type number is that multiplication takes precedence over addition which takes precedence over comparisons, and for type Boolean it is that negation takes precedence over conjunction which takes precedence over disjunction.  This still leaves open the precedence ordering between the types.  PASCAL programmers sometimes complain that they cannot write
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">IF</span>  a &lt; b  <span style="color: #00ffff;">AND</span>  c = d  <span style="color: #00ffff;">THEN</span>  ...
</pre>
</div>

<p>
but have to put both comparisons into parentheses.  This is easily fixed by treating comparisons like Boolean atoms whose precedence is higher than that of conjunction.  The most natural syntax now is:
</p>

<div class="org-src-container">

<pre class="src src-pascal">factor          ::=  variable | number | <span style="color: #00ff00;">"FALSE"</span> | <span style="color: #00ff00;">"TRUE"</span> |
                     <span style="color: #00ff00;">"NOT"</span> factor | <span style="color: #00ff00;">"("</span> expression2 <span style="color: #00ff00;">")"</span>
term1           ::=  factor [ (<span style="color: #00ff00;">"*"</span> | <span style="color: #00ff00;">"/"</span> | <span style="color: #00ff00;">"MOD"</span>) factor ]
expression1     ::=  term1 [ (<span style="color: #00ff00;">"+"</span> | <span style="color: #00ff00;">"-"</span>) term1 ]
comparison      ::=  expression1 [ (<span style="color: #00ff00;">"&lt;"</span> | <span style="color: #00ff00;">"="</span> | <span style="color: #00ff00;">"&gt;"</span>) expression1 ]
term2           ::=  comparison [ <span style="color: #00ff00;">"AND"</span> comparison ]
s-expression    ::=  term2 [ <span style="color: #00ff00;">"OR"</span> term2 ]
expression2     ::=  s-expression [ <span style="color: #00ff00;">"IFF"</span> s-expression ]
</pre>
</div>

<p>
This makes all infix operators more or less alike as far as the context free syntax.  There will be some obvious type restrictions: factors which are variables will have the type of the variable, constant factors have type integer or Boolean, negations are Boolean and must have a Boolean operand, parenthesised factors have the type of the expressions2.  All arithmetic and comparison operators require integer operands, the arithmetic operators return integer type and the comparisons return Boolean.  The logical infix operators all return Boolean.  It is important to keep in mind that the strict division into two types is in no way forced upon us by the machine - we could equally well have chosen to have these operators without any type enforcement.
</p>

<p>
Statements are either assignments, procedure calls, conditionals, loops or write statements.  As an illustration only, we choose not to have a compound statement of the form "BEGIN &#x2026; END", so the two kinds of statement which sometimes need an embedded statement sequence will have to have these built in.  This is done by several languages, including MODULA; a disadvantage is that the two sorts of ENDs are now compulsory even when there is only one statement in the statement sequence, and an advantage is that one is more likely to be able to track missing ENDs.
</p>

<div class="org-src-container">

<pre class="src src-pascal">statement  ::=  variable <span style="color: #00ff00;">":="</span> expression2 |
                <span style="color: #00ffff;">procedure</span> |
                <span style="color: #00ff00;">"IF"</span> expression2 <span style="color: #00ff00;">"THEN"</span> statementsequence <span style="color: #00ff00;">"ENDIF"</span> |
                <span style="color: #00ff00;">"WHILE"</span> expression2 <span style="color: #00ff00;">"DO"</span> statementsequence <span style="color: #00ff00;">"ENDWHILE"</span>
statementsequence  ::=  statement [ <span style="color: #00ff00;">";"</span> statement ]
</pre>
</div>

<p>
Since expressions are being typed, we shall insist that the tests in IF and WHILE statements are indeed of type Boolean.  The bodies of procedures and also of the main program will typically be statement sequences, so the following will be more readable:
</p>

<div class="org-src-container">

<pre class="src src-pascal">body   ::=   <span style="color: #00ff00;">"BEGIN"</span> statementsequence <span style="color: #00ff00;">"END"</span>
</pre>
</div>

<p>
Finally, we can design the structure of a main program.  It is beneficial to program structure if declarations of variables and of procedures can be given in any order.  We have already decided that variables are to be typed, so a type indicator is needed for both types, we can make the indicator also signal that what is being declared is a variable.  Inside a procedure the same indicators serve to declare local variables.
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">program</span>   ::=   [ (<span style="color: #00ff00;">"BOOLEAN"</span> | <span style="color: #00ff00;">"INTEGER"</span>) [identifier] |
                  <span style="color: #00ff00;">"PROCEDURE"</span> identifier
                    [ (<span style="color: #00ff00;">"BOOLEAN"</span> | <span style="color: #00ff00;">"INTEGER"</span>) [identifier] ]
                    body ]
                body <span style="color: #00ff00;">"."</span>
</pre>
</div>

<p>
We shall insist that identifiers be declared before use, but that local variables in one procedure are not visible to the outside - so different procedures can use local variables by the same name.  We shall also require that local variables do not have the same name as global ones; this is a controversial paternalistic design decision that you may wish to discuss.
</p>

<p>
At the end of the next section is a file containing three example programs.  The first illustrates recursion by computing factorials.  The second illustrates the operator precedences.  The third is there to illustrate what can be done by the compiler for generating code for expressions whose value is known at compile time.  
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> DESIGNING THE COMPILER</h2>
<div class="outline-text-2" id="text-4">
<p>
"The bliss of the language designer is matched only by the torment of the language implementor."  (Ancient proverb, late 20-th Century)
</p>

<p>
This section gives a description of the design of the compiler.  We follow the design steps recommended in Chapter 7, by distinguishing syntax and semantics.
</p>
</div>
