14-symbol-table-and-recursion.html

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Syntax</h3>
<div class="outline-text-3" id="text-4-1">
<p>
If we follow the recommendations of Chapter 7 to the letter, we would now base the parser directly on the grammar, by writing a parsing procedure for each nonterminal of the grammar.  To obtain the required visibility pattern, we should have factor innermost, and programme outermost.  But notice that all the rules for infix operators are just about identical in form, and even statement sequences are of this form.  We could make the parser much simpler by having one procedure do all the work for infix operators and even for ";", indeed it is not difficult to make it do the work for factor and for statement, too.  This will require that each infix operator (including ";") be given a numeric precedence value, and much of the parser then simply looks at the precedence of the current symbol rather than the actual symbol.  This will make it necessary that the scanner be able to tell the parser what the precedence is.
</p>

<p>
The scanner consists of the by now familiar procedure getch and the procedure getsym which reads symbols.  The handling of numeric symbols is more than familiar by now, whereas for non-numeric symbols two kinds of cases are distinguished: alphabetic and special; they differ in the kind of termination condition.  Since the language is case insensitive, lower case letters have to be translated to upper case.  When a complete symbol has been read into an alfa array, the table of reserved words has to be searched.  Since all entries in this table are known at compile time, they have been sorted at the time they were entered.  Consequently a binary search can be used.  If the symbol is found there, the parser needs to be told what kind of symbol it was, and what its precedence was.  If the symbol was not a reserved word, then a search through the symbol table is conducted.  Since the entries into the symbol table have been in no particular order, a linear search (with a sentinel) has to be used.  If the symbol has not been found, then it is entered, and the fact that it was a new identifier has to be reported to the parser.  (Note that many compilers would leave the entering into the symbol table to whatever parsing procedure handles declarations.)
</p>

<p>
.P The (global) enumeration type symbol comprises 25 values (add .. hlt) that are used in both the compiler and the interpreter, and 28 values (noop .. rparsym) that are used only in the compiler.  To make the entire program more modular, a procedure initialise is used to enter the reserved words.  For each reserved word a local procedure is called which will enter the external representation (e.g. 'BEGIN') and the internal representation (a value of the enumeration type symbol, in this case the value beginsym).  In addition a small number ('1' for beginsym) is entered to indicate the precedence of the symbol.  When the scanner recognises a reserved word, it reports to the parser both the internal representation and its precedence.  The very simple error handling procedure writes a message containing the most recently seen symbol and the specific error message transmitted via a parameter from the parser.  This completes the utilities, and we now concentrate on the syntax and semantics:
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Step 1: <i>Visibility requirements</i>.</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
As may be seen from the grammar, programme needs access to body which needs access to statementsequence, etc.  All visibility requirements are easily met by nesting.  However, because of a possible simplification for all the infix operators, we do not describe this aspect further here.
</p>
</div>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Step 2: <i>Context free parsing</i>:</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
This should present no problem for the non-terminals programme and body.  The principal parsing procedure programme is called only from main, so it could equally well be included there.  Following the grammar, a WHILE-loop is needed to handle declarations - for global variables and for procedures.  Any procedure of course may have local variables, so another WHILE-loop handles those.  All variable declarations can be handled in almost the same way, so this lends itself to the use of a parsing procedure to handle sequences of identifiers.  A procedure declaration needs to call body, and the main program does the same, terminating with a check for the final ".".  The parsing procedure for body is obvious.
</p>

<p>
Context free parsing for the remainder of the grammar can be made surprisingly simple.  All other non-terminals are potentially recursive, and those for infix operators are identical in form.  To save writing a lot of repetitive code, we deal with the rest of the context free parsing with just one recursive procedure which has a numeric value parameter which mostly indicates the precedence level of operators.  All infix operators, including ";", are handled by the following:
</p>

<div class="org-src-container">

<pre class="src src-pascal">call recursively, <span style="color: #00ffff;">with</span> actual parameter incremented by 1
<span style="color: #00ffff;">WHILE</span> the precedence <span style="color: #00ffff;">of</span> the current symbol
        <span style="color: #00ffff;">is</span> equal <span style="color: #00ffff;">to</span> the actual parameter <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span>
    getsym;
    call recursively, actual parameter incremented by 1
    <span style="color: #00ffff;">END</span>;
</pre>
</div>

<p>
The two parameter values for which this pattern is not called for are treated separately: for statements and for factors.  These are modelled directly on the grammar.
</p>
</div>
</div>
<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Step 3: <i>Declarations</i>:</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
We now come to the context sensitive aspects of the parser.  First comes the management of the symbol table to enforce that identifiers have to be declared before use.  Much of the work can already be done by the scanner: when a symbol is not a reserved word the current symbol table is searched, and if the symbol is not found then it is entered as new.  The entry is completed either by the parsing procedure for global or local variables, or by programme for procedures.  For procedure declarations it is important to hide the names of all local variables from the outside.  So when local variables are being declared they have to remain visible up to the end of the procedure to which they are local, and then they have to disappear.  A simple way of achieving this is to reset the top of the symbol table to what it was before the locals were being declared.  So the top of the symbol table has to be saved before any locals are being declared, and when the compilation of the body of the procedure has been completed the top of the symbol table has to be restored to what it was when saved.
</p>
</div>
</div>
<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> Step 4: <i>Types</i>.</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
The other aspect of the context sensitive syntax concerns types.  When variables are being entered in the symbol table, their type is recorded by the procedure for global and local variables.  If that variable is later used, its type is immediately available.  So when a variable is seen in factor, the all-in-one parsing procedure needs a VAR parameter which has to be set to the type of the variable.  All this is already familiar from our earlier program TYPROC in Chapter 7, including the treatment of constants, all operators, the required type checking there and the assignment of result types, the Boolean type of conditions in IF and WHILE statements and the type agreement in assignment statements.
</p>
</div>
</div>
</div>
