14-symbol-table-and-recursion.html
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Semantics</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Since the machine and its code is already supplied, we do not have to design code that is eventually passed to the machine.  The code has to be emitted to a FILE of instructions, but before the code is emitted, it has to be manipulated slightly in an internal form.  The simplest internal form is that of an ARRAY of instructions.  The internal code to be generated has to have the right instructions with the right references to memory and to the right registers.  These are three separate concerns.
</p>
</div>

<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Step 5: <i>Memory management</i>.</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
In the interpreter there is a data structure called the stack which holds the values of global and local variables.  When a procedure is entered, space for its local variables is reserved on this stack, and if a procedure is being called recursively then there will be several instances of local variables.  None of this exists at compile time, except that the ordering of local variables in a procedure is known, and when all local variables of a procedure have been declared, their total number is known.  When the body of the procedure has been compiled, the count of the data on the stack is restored in the same way as the top of the symbol table is restored.  Thus, whenever a variable is declared its absolute address (for globals) or its relative address (for locals) has to be entered into the symbol table.  This is best done when its type is being recorded by the parsing procedure for global and local variables.  The address will later be needed in assignment statements and in factors.  Similarly, when a procedure is being declared the total number of its local variables has to be recorded for later use in procedure call statements.
</p>
</div>
</div>
<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Step 6: <i>Generating opcodes</i>:</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Code in an internal ARRAY is best generated by a now familiar procedure with three parameters which become the three fields of an instruction.  Initially we concentrate on the operation field: Inside factor all constants generate an immediate load operation, global and local variables generate a global load or local load, negations generate a negation operation - just as for postfix.  All infix operators generate the corresponding machine operation, except that for logical conjunction we can use arithmetic multiplication.  Again, the instructions are generated after both operands have been compiled - just as for postfix.  In statements, assignment statements to globals or locals generate global or local store operations, the instructions are generated after the expression has been processed.  Statements which are procedure calls generate call instructions.  In IF and WHILE statements a conditional jump instruction has to be generated after the expression has been processed, the effect of the jump is to skip the THEN or DO part.  In WHILE statements after the DO part an unconditional jump has to be generated to jump back to the test.
</p>
</div>
</div>
<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> Step 7: <i>Memory references</i>.</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
As described so far, memory references in load and store operations have not yet been inserted.  Inside factors, in load operations for global and local variables the required second address is taken from the symbol table, in load operations for literals the value for the second address field is either the number returned by the scanner, or 0 for FALSE and 1 for TRUE.  Inside assignment statements the first address field has to be taken from the symbol table; but since the instruction is generated well after the variable is seen, the address has to be saved for later generation.
</p>
</div>
</div>
<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> Step 8: <i>Code references</i>.</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Several instructions which are generated inside statements require an address field which is a code address.  Procedure calls are easiest: here the code address is taken from the symbol table as the instruction is being generated, and the other field, the number of locals (+ 2, as required by the machine) is also taken from the table.  A little trickier are the conditional and unconditional jump instructions in IF and WHILE statements.  As the conditional jump instructions are generated, the target address of the jump is not yet known since the THEN or DO parts have not been read yet.  A very simple solution is a "fixup": as the instruction is being generated, we save in a local variable where in the code this incomplete instruction resides; and when the THEN or DO part has been processed the required address field of the instruction at the saved address is set to the next instruction number that is due to be generated.  Note that the need for these fixups is the only reason for not emitting the code directly to a file.  In WHILE statements the unconditional jump at the end of the DO part is a little easier: before processing the expression we record in a local variable the first instruction number due to be generated by the expression, and when generating the unconditional jump we use that saved code address.  A final point concerns the main program.  When the code that is generated is eventually interpreted, it has to start at the beginning of the code generated by programme, and not at any of the procedures.  A convenient way of ensuring that this happens is to let the very first instruction, generated right at the beginning of programme, be a call of the body of the code for programme.  Since the address of what is being called is not known at the beginning of the program, an incomplete call instruction has to be generated by programme before any declarations are processed, and when the processing of the body is about to start, this instruction can be fixed up with the now known number of globals and the address of the next instruction due to be generated by the body.
</p>
</div>
</div>
