14-symbol-table-and-recursion.html
<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="section-number-4">4.2.5</span> Step 9: <i>Register references</i>.</h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
This is perhaps the hardest part, and it is best to reflect again on evaluation of postfix expressions on a stack, as described in our truth table program.  The fact that we now have integer operands makes no difference.  When evaluating expressions on a stack, all operands are pushed onto the stack and all operators take their operands from the top few elements of the stack.  The values that are to be pushed or operated on are typically not known at compile time, but their position on the stack is known - at least relative to what the stack was before the evaluation of the expression commenced.  For our language we can evaluate expressions on a make-believe stack if we consider the registers to form a stack, starting with register 0 as the lowest stack position.  So, when assignment statements or IF and WHILE statements require an expression to be evaluated, they can tell the all-in-one procedure that the value is expected in register 0.  This already settles the register references in store and conditional jump instructions.  The telling is best done by a new parameter which is the numeric name of the register where a value is to be found.  When the all-in-one parsing procedure calls itself recursively for infix operators it first calls itself with its own register parameter, and while the operator matches the current precedence it calls itself with the successor of that register as a parameter and upon return from that the code that has been generated from the two calls will leave two values in adjacent registers - hence the required address fields for all infix operators are the ones given by this new parameter and its successor.  Eventually the highest precedence will be reached, and load instructions will be generated - for these the required register address is this parameter.
</p>
</div>
</div>
<div id="outline-container-sec-4-2-6" class="outline-4">
<h4 id="sec-4-2-6"><span class="section-number-4">4.2.6</span> Step 10: <i>Constant folding</i>.</h4>
<div class="outline-text-4" id="text-4-2-6">
<p>
If the values of the operands of an operator are already known at compile time, the resulting value need not be computed every time the program is run, but could be computed at compile time.  If the two instructions preceding an infix operator are immediate load instructions, then the operator could be applied to the two values to be loaded, and the two load instructions replaced by a new one to load the computed value - no instruction is generated for the operator.  One additional benefit of the all-in-one procedure for all infix operators is that the test for two successive immediate load instructions can be done in just one place, when the code for the second operand has been generated and before the code for the operator is generated.  If the test is passed, a CASE statement computes the required value depending on what the infix operator was, replaces the first value to be loaded by the computed one and deletes the second load instruction.  Essentially the same is done for the unary negation operator.
</p>
</div>
</div>
</div>
