text/14-symbol-table-and-recursion.org
** A Look Inside

The following is the total output from three runs of the compiler and of the interpreter.  Each run consists of

1) a program (here echoed by the operating system, not by the compiler),
2) a readable form of the code written by the compiler, and
3) the output produced by the interpreter.

The three programs illustrate recursion, large expressions, and constant folding.

#+begin_src pascal
$ ! compile a program to compute factorials
$ RUN 32SYRECC.EXE
?
INTEGER argument value

PROCEDURE factorial
    INTEGER temporary
    BEGIN
    IF argument = 0 THEN
	value := 1
	ENDIF;
    IF argument <> 0 THEN
	temporary := argument;
	argument := argument - 1;
	factorial;
	value := temporary * value;
	argument := temporary
	ENDIF
    END

                total of 1 variable(s)

BEGIN
argument := 0;
WHILE argument <= 10 DO
    factorial;
    WRITE value;
    argument := argument + 1
    ENDWHILE
END .

                total of 2 variable(s)

code written to 32SYRECI.TMP :
 address             op       ad1       ad2
       1            CAL        26         2
       2      LOADGLOBL         0         0
       3      LOADIMMED         1         0
       4            EQL         0         1
       5            JIZ         8         0
       6      LOADIMMED         0         1
       7      STORGLOBL         1         0
       8      LOADGLOBL         1         0
       9      LOADIMMED         2         0
      10            NEQ         1         2
      11            JIZ        25         1
      12      LOADGLOBL         0         0
      13      STORLOCAL         0         0
      14      LOADGLOBL         0         0
      15      LOADIMMED         1         1
      16            SUB         0         1
      17      STORGLOBL         0         0
      18            CAL         2         3
      19      LOADLOCAL         0         0
      20      LOADGLOBL         1         1
      21            MUL         0         1
      22      STORGLOBL         1         0
      23      LOADLOCAL         0         0
      24      STORGLOBL         0         0
      25            RET         0         0
      26      LOADIMMED         0         0
      27      STORGLOBL         0         0
      28      LOADGLOBL         1         0
      29      LOADIMMED         2        10
      30            LEQ         1         2
      31            JIZ        40         1
      32            CAL         2         3
      33      LOADGLOBL         2         1
      34       WRITEINT         0         2
      35      LOADGLOBL         0         0
      36      LOADIMMED         1         1
      37            ADD         0         1
      38      STORGLOBL         0         0
      39            JMP        28         0
      40            HLT         0         0
done
$
$ ! now run the interpreter
$ RUN 32SYRECI.exe
SYRECI ...
         1
         1
         2
         6
        24
       120
       720
      5040
     40320
    362880
   3628800
$
$
$ ! compile a program to illustrate operator precedences
$ RUN 32SYRECC.EXE
?
INTEGER i j k
BOOLEAN p q r
BEGIN
i := 1; j := 2; k := 3; p := TRUE; q := FALSE; r := TRUE;
WRITE
      k * 1  -  j * i   >   i + j + k * i
    AND
      k   <   i + j
  OR
    p AND NOT q
  OR
    r AND i = j - k AND NOT (k + i > j - i * i)
END .

                total of 6 variable(s)

code written to 32SYRECI.TMP :
 address             op       ad1       ad2
       1            CAL         2         6
       2      LOADIMMED         0         1
       3      STORGLOBL         0         0
       4      LOADIMMED         0         2
       5      STORGLOBL         1         0
       6      LOADIMMED         0         3
       7      STORGLOBL         2         0
       8      LOADIMMED         0         1
       9      STORGLOBL         3         0
      10      LOADIMMED         0         0
      11      STORGLOBL         4         0
      12      LOADIMMED         0         1
      13      STORGLOBL         5         0
      14      LOADGLOBL         1         2
      15      LOADIMMED         2         1
      16            MUL         1         2
      17      LOADGLOBL         2         1
      18      LOADGLOBL         3         0
      19            MUL         2         3
      20            SUB         1         2
      21      LOADGLOBL         2         0
      22      LOADGLOBL         3         1
      23            ADD         2         3
      24      LOADGLOBL         3         2
      25      LOADGLOBL         4         0
      26            MUL         3         4
      27            ADD         2         3
      28            GTR         1         2
      29      LOADGLOBL         2         2
      30      LOADGLOBL         3         0
      31      LOADGLOBL         4         1
      32            ADD         3         4
      33            LSS         2         3
      34            MUL         1         2
      35      LOADGLOBL         2         3
      36      LOADGLOBL         3         4
      37            NEG         3         0
      38            MUL         2         3
      39            ORR         1         2
      40      LOADGLOBL         2         5
      41      LOADGLOBL         3         0
      42      LOADGLOBL         4         1
      43      LOADGLOBL         5         2
      44            SUB         4         5
      45            EQL         3         4
      46            MUL         2         3
      47      LOADGLOBL         3         2
      48      LOADGLOBL         4         0
      49            ADD         3         4
      50      LOADGLOBL         4         1
      51      LOADGLOBL         5         0
      52      LOADGLOBL         6         0
      53            MUL         5         6
      54            SUB         4         5
      55            GTR         3         4
      56            NEG         3         0
      57            MUL         2         3
      58            ORR         1         2
      59      WRITEBOOL         0         1
      60            HLT         0         0
done
$ ! now run the interpreter
$ RUN 32SYRECI.EXE
SYRECI ...
  TRUE
$

$! compile a program to illustrate constant folding
$ RUN 32SYRECC.EXE
?
BEGIN
WRITE
    1 * (5000 + 5000) +
    2 * (600 + 400) +
    3 * (70 + 30) +
    4 * (8 + 2) +
    5 * (1000 - 900 - 90 - 9)
END .

                total of 0 variable(s)

code written to 32SYRECI.TMP :
 address             op       ad1       ad2
       1            CAL         2         0
       2      LOADIMMED         0     12345
       3       WRITEINT         0         0
       4            HLT         0         0
done
$ ! now run the interpreter
$ RUN 32SYRECI.EXE
SYRECI ...
     12345
#+end_src

* The Compiler

This version of the notes does not include the sources.

