text/14-symbol-table-and-recursion.org
* Exercises and Reading

Both the high level language treated in this chapter and the virtual machine with its low level language lend themselves to extensive improvements.

** /Manual/:
In section 2 of this chapter the more important design decisions for the high level language were discussed.  But in a manual one does not want such a discussion, only a very precise description of the language including any necessary details of the implementation.  Write such a manual.  Base your manual either on the information you have now, or on some other design decisions you made yourself.

** /Use of identifiers/:
1) As designed so far, the language forbids the re-use of identifiers even where this would be quite harmless. Identify these cases, and then discuss whether more flexibility should be allowed.

2) Whether or not you thought that it is a good idea, change the manual and the implementation to allow maximum flexibility for the user.

** /Records and arrays/:
Try to add records to the high level language.  Try to add arrays to the high level language - restrict yourself to one dimensional arrays initially.  Are any new instructions needed for the machine?

** /Constant folding/:
The compiler can fold constants in expressions such as "a + 2 + 3" by adding the 2 and the 3 at compile time and then generating the same code as for "a + 5".  But the compiler cannot handle the possible folding of constants in "2 + a + 3", because the two constants 2 and 3 do not occur consecutively.  How difficult would it be to handle constant folding here?  Would it be easier if the code were in tree format?

** /A different machine/:
The hardware manufacturers have decided to delete the halt instruction.  Fix the compiler.  The manufacturers have decided to delete the unconditional jump instruction. Fix the compiler.  The manufacturers have decided to halve the number of comparison operators.  Which ones should they retain? Fix the compiler.  The hardware manufacturers have noticed that the base register and the top of stack perform complementary functions, and they wish to replace this pair of registers by just one.  Advise them how this can be done in a way that does not require any change to the compiler.  Alternatively, advise them how it can be done by letting the return instruction make use of an address field to decrement the base register.

** /Instruction folding/:
For simple assignment statements such as "a := 5" the compiler has to generate two instructions:

1) to load 5 into a register, and
2) to store the value in that register at the location for a.

It would clearly be more efficient if this could be done by one instruction.  There is no such instruction in the machine as described by the interpreter program, so you will have to add one.  But actually you need two, depending on whether the variable a is global or local.  Also, if instead of the constant value 5 the value of a variable, say b, is to be assigned to a, then the same kind of optimisation is possible.  How many new single instructions do you need now?  All these modifications to the interpreter are of no use unless the compiler can recognise the special cases and generate the new instructions appropriately.  Modify the compiler to handle all the new instructions.  There is another class of possible optimisations for assignment statements of the form "a := a + b", where a is a global or local variable and b is a constant (possibly folded) or a global or local variable.  Can you devise single instructions for these assignment statements?  Of course these optimising extensions have to be applied to operators other than addition.  The total number of machine instructions grows very rapidly.  Study the PDP11 or the VAX assembly language to see how this explosion can be prevented by adding the concept of addressing mode.

** /Parameters/:

As the example program which computes factorials shows, it is possible to use global variables to serve the same purpose as (value) parameters to procedures.  So parameters are not really necessary, as long as there are local variables available in which the value of global variables can be saved when necessary.  But the technique can be cumbersome.  Extend the manual and the compiler to handle (properly typed) value parameters.  Can you do all this without adding any new instructions to the interpreter?  Can you add VAR parameters without adding new instructions to the interpreter?

** /Functions/:

As the factorial program shows, programming with procedures is often possible where programming with functions would be more natural.  Try to add (properly typed) functions to the language, without adding any new features to the interpreter.  Can your extension handle recursive function calls properly?  Since function calls occur inside expressions, is there a problem about the limited number (8) of registers?  You might decide to save the contents of some registers somewhere in memory before the body of the function is executed, and to restore them afterwards, but the hard part is to avoid any unnecessary saves and restores.  The exercise will make you appreciate the advantages of a pure stack machine (i.e. without registers) as in Wirth's PLZERO machine.

** /Input and output/:

The machine has an unrealistically high level machine instruction for writing integers.  Replace this by an instruction for writing characters given by an ASCII number.  Change the compiler so that for each number to be written it will write the correct string of digits.  This can be done by in-line code or by a procedure to be called whenever a number is to be written.  Alternatively, design an IO library of "system" calls for such tasks.  Do the same for reading characters and reading integers.

** /An assembler/:

Design a low level assembly language for this machine.  Write an assembler. You might even include macros.

