14-symbol-table-and-recursion.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Exercises and Reading</h2>
<div class="outline-text-2" id="text-6">
<p>
Both the high level language treated in this chapter and the virtual machine with its low level language lend themselves to extensive improvements.
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <i>Manual</i>:</h3>
<div class="outline-text-3" id="text-6-1">
<p>
In section 2 of this chapter the more important design decisions for the high level language were discussed.  But in a manual one does not want such a discussion, only a very precise description of the language including any necessary details of the implementation.  Write such a manual.  Base your manual either on the information you have now, or on some other design decisions you made yourself.
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> <i>Use of identifiers</i>:</h3>
<div class="outline-text-3" id="text-6-2">
<ol class="org-ol">
<li>As designed so far, the language forbids the re-use of identifiers even where this would be quite harmless. Identify these cases, and then discuss whether more flexibility should be allowed.
</li>

<li>Whether or not you thought that it is a good idea, change the manual and the implementation to allow maximum flexibility for the user.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> <i>Records and arrays</i>:</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Try to add records to the high level language.  Try to add arrays to the high level language - restrict yourself to one dimensional arrays initially.  Are any new instructions needed for the machine?
</p>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> <i>Constant folding</i>:</h3>
<div class="outline-text-3" id="text-6-4">
<p>
The compiler can fold constants in expressions such as "a + 2 + 3" by adding the 2 and the 3 at compile time and then generating the same code as for "a + 5".  But the compiler cannot handle the possible folding of constants in "2 + a + 3", because the two constants 2 and 3 do not occur consecutively.  How difficult would it be to handle constant folding here?  Would it be easier if the code were in tree format?
</p>
</div>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> <i>A different machine</i>:</h3>
<div class="outline-text-3" id="text-6-5">
<p>
The hardware manufacturers have decided to delete the halt instruction.  Fix the compiler.  The manufacturers have decided to delete the unconditional jump instruction. Fix the compiler.  The manufacturers have decided to halve the number of comparison operators.  Which ones should they retain? Fix the compiler.  The hardware manufacturers have noticed that the base register and the top of stack perform complementary functions, and they wish to replace this pair of registers by just one.  Advise them how this can be done in a way that does not require any change to the compiler.  Alternatively, advise them how it can be done by letting the return instruction make use of an address field to decrement the base register.
</p>
</div>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> <i>Instruction folding</i>:</h3>
<div class="outline-text-3" id="text-6-6">
<p>
For simple assignment statements such as "a := 5" the compiler has to generate two instructions:
</p>

<ol class="org-ol">
<li>to load 5 into a register, and
</li>
<li>to store the value in that register at the location for a.
</li>
</ol>

<p>
It would clearly be more efficient if this could be done by one instruction.  There is no such instruction in the machine as described by the interpreter program, so you will have to add one.  But actually you need two, depending on whether the variable a is global or local.  Also, if instead of the constant value 5 the value of a variable, say b, is to be assigned to a, then the same kind of optimisation is possible.  How many new single instructions do you need now?  All these modifications to the interpreter are of no use unless the compiler can recognise the special cases and generate the new instructions appropriately.  Modify the compiler to handle all the new instructions.  There is another class of possible optimisations for assignment statements of the form "a := a + b", where a is a global or local variable and b is a constant (possibly folded) or a global or local variable.  Can you devise single instructions for these assignment statements?  Of course these optimising extensions have to be applied to operators other than addition.  The total number of machine instructions grows very rapidly.  Study the PDP11 or the VAX assembly language to see how this explosion can be prevented by adding the concept of addressing mode.
</p>
</div>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> <i>Parameters</i>:</h3>
<div class="outline-text-3" id="text-6-7">
<p>
As the example program which computes factorials shows, it is possible to use global variables to serve the same purpose as (value) parameters to procedures.  So parameters are not really necessary, as long as there are local variables available in which the value of global variables can be saved when necessary.  But the technique can be cumbersome.  Extend the manual and the compiler to handle (properly typed) value parameters.  Can you do all this without adding any new instructions to the interpreter?  Can you add VAR parameters without adding new instructions to the interpreter?
</p>
</div>
</div>
<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> <i>Functions</i>:</h3>
<div class="outline-text-3" id="text-6-8">
<p>
As the factorial program shows, programming with procedures is often possible where programming with functions would be more natural.  Try to add (properly typed) functions to the language, without adding any new features to the interpreter.  Can your extension handle recursive function calls properly?  Since function calls occur inside expressions, is there a problem about the limited number (8) of registers?  You might decide to save the contents of some registers somewhere in memory before the body of the function is executed, and to restore them afterwards, but the hard part is to avoid any unnecessary saves and restores.  The exercise will make you appreciate the advantages of a pure stack machine (i.e. without registers) as in Wirth's PLZERO machine.
</p>
</div>
</div>
<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> <i>Input and output</i>:</h3>
<div class="outline-text-3" id="text-6-9">
<p>
The machine has an unrealistically high level machine instruction for writing integers.  Replace this by an instruction for writing characters given by an ASCII number.  Change the compiler so that for each number to be written it will write the correct string of digits.  This can be done by in-line code or by a procedure to be called whenever a number is to be written.  Alternatively, design an IO library of "system" calls for such tasks.  Do the same for reading characters and reading integers.
</p>
</div>
</div>
<div id="outline-container-sec-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="section-number-3">6.10</span> <i>An assembler</i>:</h3>
<div class="outline-text-3" id="text-6-10">
<p>
Design a low level assembly language for this machine.  Write an assembler. You might even include macros.
</p>
</div>
</div>
