text/14-symbol-table-and-recursion.org
** /Reading/:

For expositions of the implementation of block-structured languages, see Wirth (1976, Ch. 5, esp. Sec. 5.10) and MacLennan (1983, Ch. 6).

For a compiler along the same lines as PLZERO, but for a much larger language, see Wirth's PASCAL-S reprinted in Berry (1981).

An excellent book on compilers which uses PASCAL-S as the principal example is Rees and Robson (1988).

See also The Open University (1986) for the stepwise development
of a compiler based on PASCAL-S (the acknowledgement, seemingly as an afterthought, appears in Vol. 1, p. 20, footnote).

Terry (1986) extends PASCAL-S with concurrency and monitors.  Brinch Hansen (1985) is another excellent book describing a two pass compiler-interpreter for a substantial subset of PASCAL.

If you are familiar with UNIX and the C programming language, you might like to look at Kernighan and Pike (1984, Chapter 8) for a small compiler written largely in the compiler writing tool YACC.

For a more detailed exposition of YACC, and a development of a compiler for a subset of C, see Schreiner and Friedman (1985).  Another small compiler, written in LEX and YACC, producing code for a hypothetical register machine, is described in Bennett (1990).

Loeckx, Mehlhorn and Wilhelm (1988) give a systematic development and an (informal) correctness proof for a compiler.  The source language is similar to PASCAL, the target language is for a low level machine which in some respects is even simpler than those for PLZERO, PASCAL-S and the P-CODE machine.

A very sophisticated interpreter for the unconventional language ICON is described in Griswold and Griswold (1986).
